app/views/customers/_car_detail.html.erb

SELECT  "car_details".* FROM "car_details" WHERE "car_details"."car_id" = ?  ORDER BY "car_details"."id" DESC LIMIT 1  [["car_id", 333]]
---
  <td><%=car_detail.color%></td>
  <td><%=car_detail.car_details.last.servicing_date%></td>