app/views/cars/show.html.erb

SELECT  "car_details".* FROM "car_details" WHERE "car_details"."car_id" = ?  ORDER BY "car_details"."id" DESC LIMIT 1  [["car_id", 335]]
---
        <td>Last Servicing Date</td>
        <td><%=@car.car_details.last.servicing_date%></td>